<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 应用设置
// +----------------------------------------------------------------------

return [
    'app_version' => ['v1', 'v2'], // 验证debug
    'app' => [
        'version' => [
            'android'       => [
                'info' => '更新内容：\r\n1.已知bug',
                'version'      => '2.1.1', //版本号
                'must_update'  => 0, //是否热更新 1 不是: 0  是
                'download_url' => '', //下载地址
            ],
            'ios'           => [
                'info' => '更新内容：\r\n1.已知bug',
                'version'      => '2.1.0', //版本号
                'must_update'  => 0, //是否热更新 1  不是  0  是
                'download_url' => '', //下载地址
            ],
            'download_url' => '', //更新的包名

            'info' => '更新内容：\r\n1.已知bug',
            'versionStatus' => 1, // 是否都更新 1 都更新 0 不更新
            'version'       => '2.1.1', // 版本号
            'appWgtSize'    => '2078', //更新包大小 KB
        ],

        'uuid' => '',
        'switchStatus' => 2, //0：关闭全部更新 1：全部更新  2：沙盒测试
    ],


];
